export const data = [
  {
    id: 1,
    question: "Какое из этих чисел делится на 9 без остатка?",
    variants: ["972", "600", "336", "376", "301"],
    correctIndex: 0,
  },
  {
    id: 2,
    question: "Если сегодня среда, то что будет через 4 дня со вчерашнего дня?",
    variants: ["Вторник", "Пятница", "Воскресенье", "Суббота"],
    correctIndex: 3,
  },
  {
    id: 3,
    question:
      "Предположим вы едете на поезде по Англии и вдруг увидели белую козу которая неподвижно стоит посреди зелёного луга. Какая из гипотез наиболее логична?",
    variants: [
      "В Англии есть как минимум одна белая коза.",
      "В Англии есть как минимум одна коза, которая, по-крайней мере с одной стороны - белая.",
      "В Англии много белых коз",
    ],
    correctIndex: 1,
  },
  {
    id: 4,
    question:
      "Все пегасы умеют летать. Некоторые единороги являются пегасами. Значит, все единороги могут летать.",
    variants: ["Верно", "Неверно"],
    correctIndex: 1,
  },
  {
    id: 5,
    question:
      "Яблоко тяжелее апельсина, а апельсин тяжелее арбуза. Что тяжелее арбуз или яблоко?",
    variants: ["Яблоко тяжелее арбуза", "Арбуз тяжелее яблока"],
    correctIndex: 1,
  },
  {
    id: 6,
    question: "Продолжите последовательность 0, 1, 1, 2, 3, 5, 8...",
    variants: ["10", "11", "13", "9"],
    correctIndex: 2,
  },
  {
    id: 7,
    question:
      "Деду, отцу и сыну вместе 100 лет. Отцу и сыну вместе 45 лет. Сын на 25 лет моложе отца. Сколько кому лет?",
    variants: [
      "Деду 60 лет, сыну 5 лет, отцу 35 лет.",
      "Деду 65 лет, сыну 10 лет, отцу 25 лет.",
      "Деду 55 лет, сыну 10 лет, отцу 35 лет.",
    ],
    correctIndex: 2,
  },
  {
    id: 8,
    question:
      "Ученые обнаружили в горах более десятка алкозавров. Все обнаруженные багорики сплошь синего цвета.",
    variants: [
      "по крайней мере некоторые из алкозавров не синего цвета",
      "по крайней мере некоторые из алкозавров синего цвета",
      "все алкозавры синие",
    ],
    correctIndex: 2,
  },
  {
    id: 9,
    question:
      "Представьте, что воздушный шар уносится непрерывным ветром на юг. Тогда в какую сторону развеваются флаги на его кабине?",
    variants: [
      "Не будут развеваться",
      "В сторону запада",
      "В сторону юга",
      "В сторону севера",
    ],
    correctIndex: 0,
  },
  {
    id: 10,
    question:
      "Если в 12 часов ночи идет дождь, то есть ли вероятность, что через 72 часа будет солнечная погода?",
    variants: ["Да", "Нет", "Наверное", "Данетнаверное"],
    correctIndex: 1,
  },
  {
    id: 11,
    question:
      "На одной чаше весов лежит булыжник, масса которого равна 2 кг, на другой — желез­ная гиря той же массы. Представим, что весы опустили под воду. Остались ли чаши в равновесии?",
    variants: ["Да", "Нет", "Наверное"],
    correctIndex: 1,
  },
  {
    id: 12,
    question:
      "В доме живут питомцы: кошки и собаки. Из всех животных только одно не собака, при этом все питомцы, кроме одного — кошки. Как вы думаете, сколько всего кошек и собак?",
    variants: ["Четверо", "Трое", "Двое"],
    correctIndex: 2,
  },
  {
    id: 13,
    question:
      "В доме живут питомцы: кошки и собаки. Из всех животных только одно не собака, при этом все питомцы, кроме одного — кошки. Как вы думаете, сколько всего кошек и собак?",
    variants: ["Четверо", "Трое", "Двое"],
    correctIndex: 2,
  },
  {
    id: 14,
    question:
      "Мяфчики - очень скрытные существа. Ученые предполагают, что в мире живёт 100 мяфчиков, но видели всего 60 и все из них были белыми.",
    variants: [
      "Вероятнее всего необнаруженные мяфчики не белого цвета",
      "Высока вероятность того что все мяфчики белые",
      "Вероятность того что все мяфчики белые ничтожно мала",
    ],
    correctIndex: 1,
  },
];
